In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("PATH/Q7.csv")

In [3]:
df.head() #top 5 values

          Unnamed: 0  Points  Score  Weigh
0          Mazda RX4    3.90  2.620  16.46
1      Mazda RX4 Wag    3.90  2.875  17.02
2         Datsun 710    3.85  2.320  18.61
3     Hornet 4 Drive    3.08  3.215  19.44
4  Hornet Sportabout    3.15  3.440  17.02

In [4]:
df.head(10) #top ten values

          Unnamed: 0  Points  Score  Weigh
0          Mazda RX4    3.90  2.620  16.46
1      Mazda RX4 Wag    3.90  2.875  17.02
2         Datsun 710    3.85  2.320  18.61
3     Hornet 4 Drive    3.08  3.215  19.44
4  Hornet Sportabout    3.15  3.440  17.02
5            Valiant    2.76  3.460  20.22
6         Duster 360    3.21  3.570  15.84
7          Merc 240D    3.69  3.190  20.00
8           Merc 230    3.92  3.150  22.90
9           Merc 280    3.92  3.440  18.30

## Attributes

In [5]:
df.dtypes #data types

Unnamed: 0     object
Points        float64
Score         float64
Weigh         float64
dtype: object

In [6]:
df.columns #name of columns

Index(['Unnamed: 0', 'Points', 'Score', 'Weigh'], dtype='object')

In [7]:
df.sample #displays everything

<bound method NDFrame.sample of              Unnamed: 0  Points  Score  Weigh
0             Mazda RX4    3.90  2.620  16.46
1         Mazda RX4 Wag    3.90  2.875  17.02
2            Datsun 710    3.85  2.320  18.61
3        Hornet 4 Drive    3.08  3.215  19.44
4     Hornet Sportabout    3.15  3.440  17.02
5               Valiant    2.76  3.460  20.22
6            Duster 360    3.21  3.570  15.84
7             Merc 240D    3.69  3.190  20.00
8              Merc 230    3.92  3.150  22.90
9              Merc 280    3.92  3.440  18.30
10            Merc 280C    3.92  3.440  18.90
11           Merc 450SE    3.07  4.070  17.40
12           Merc 450SL    3.07  3.730  17.60
13          Merc 450SLC    3.07  3.780  18.00
14   Cadillac Fleetwood    2.93  5.250  17.98
15  Lincoln Continental    3.00  5.424  17.82
16    Chrysler Imperial    3.23  5.345  17.42
17             Fiat 128    4.08  2.200  19.47
18          Honda Civic    4.93  1.615  18.52
19       Toyota Corolla    4.22  1.835  19.90
20        Toyota Corona    3.70  2.465  20.01
21     Dodge Challenger    2.76  3.520  16.87
22          AMC Javelin    3.15  3.435  17.30
23           Camaro Z28    3.73  3.840  15.41
24     Pontiac Firebird    3.08  3.845  17.05
25            Fiat X1-9    4.08  1.935  18.90
26        Porsche 914-2    4.43  2.140  16.70
27         Lotus Europa    3.77  1.513  16.90
28       Ford Pantera L    4.22  3.170  14.50
29         Ferrari Dino    3.62  2.770  15.50
30        Maserati Bora    3.54  3.570  14.60
31           Volvo 142E    4.11  2.780  18.60>

In [8]:
df.axes #labels of rows and columns

[RangeIndex(start=0, stop=32, step=1),
 Index(['Unnamed: 0', 'Points', 'Score', 'Weigh'], dtype='object')]

In [9]:
df.size #total count of values

128

In [10]:
df.shape #number of rows,columns

(32, 4)

In [13]:
df.shape[0] #number of rows

32

In [11]:
df.values #displays each row in an array

array([['Mazda RX4', 3.9, 2.62, 16.46],
       ['Mazda RX4 Wag', 3.9, 2.875, 17.02],
       ['Datsun 710', 3.85, 2.32, 18.61],
       ['Hornet 4 Drive', 3.08, 3.215, 19.44],
       ['Hornet Sportabout', 3.15, 3.44, 17.02],
       ['Valiant', 2.76, 3.46, 20.22],
       ['Duster 360', 3.21, 3.57, 15.84],
       ['Merc 240D', 3.69, 3.19, 20.0],
       ['Merc 230', 3.92, 3.15, 22.9],
       ['Merc 280', 3.92, 3.44, 18.3],
       ['Merc 280C', 3.92, 3.44, 18.9],
       ['Merc 450SE', 3.07, 4.07, 17.4],
       ['Merc 450SL', 3.07, 3.73, 17.6],
       ['Merc 450SLC', 3.07, 3.78, 18.0],
       ['Cadillac Fleetwood', 2.93, 5.25, 17.98],
       ['Lincoln Continental', 3.0, 5.424, 17.82],
       ['Chrysler Imperial', 3.23, 5.345, 17.42],
       ['Fiat 128', 4.08, 2.2, 19.47],
       ['Honda Civic', 4.93, 1.615, 18.52],
       ['Toyota Corolla', 4.22, 1.835, 19.9],
       ['Toyota Corona', 3.7, 2.465, 20.01],
       ['Dodge Challenger', 2.76, 3.52, 16.87],
       ['AMC Javelin', 3.15, 3.435, 17.3],
       ['Camaro Z28', 3.73, 3.84, 15.41],
       ['Pontiac Firebird', 3.08, 3.845, 17.05],
       ['Fiat X1-9', 4.08, 1.935, 18.9],
       ['Porsche 914-2', 4.43, 2.14, 16.7],
       ['Lotus Europa', 3.77, 1.513, 16.9],
       ['Ford Pantera L', 4.22, 3.17, 14.5],
       ['Ferrari Dino', 3.62, 2.77, 15.5],
       ['Maserati Bora', 3.54, 3.57, 14.6],
       ['Volvo 142E', 4.11, 2.78, 18.6]], dtype=object)

In [12]:
df.ndim #number of dimensions

2

## Methods

In [15]:
df.tail(3)

       Unnamed: 0  Points  Score  Weigh
29   Ferrari Dino    3.62   2.77   15.5
30  Maserati Bora    3.54   3.57   14.6
31     Volvo 142E    4.11   2.78   18.6

In [16]:
df.head(3)

      Unnamed: 0  Points  Score  Weigh
0      Mazda RX4    3.90  2.620  16.46
1  Mazda RX4 Wag    3.90  2.875  17.02
2     Datsun 710    3.85  2.320  18.61

In [21]:
df.describe()

          Points      Score      Weigh
count  32.000000  32.000000  32.000000
mean    3.596563   3.217250  17.848750
std     0.534679   0.978457   1.786943
min     2.760000   1.513000  14.500000
25%     3.080000   2.581250  16.892500
50%     3.695000   3.325000  17.710000
75%     3.920000   3.610000  18.900000
max     4.930000   5.424000  22.900000

In [17]:
df.max()

Unnamed: 0    Volvo 142E
Points              4.93
Score              5.424
Weigh               22.9
dtype: object

In [18]:
df.min()

Unnamed: 0    AMC Javelin
Points               2.76
Score               1.513
Weigh                14.5
dtype: object

In [22]:
df.mean()

  df.mean()

Points     3.596563
Score      3.217250
Weigh     17.848750
dtype: float64

In [23]:
df.std()

  df.std()

Points    0.534679
Score     0.978457
Weigh     1.786943
dtype: float64

In [24]:
df.median()

  df.median()

Points     3.695
Score      3.325
Weigh     17.710
dtype: float64

In [26]:
df.dropna() #deletes the row that has null values

             Unnamed: 0  Points  Score  Weigh
0             Mazda RX4    3.90  2.620  16.46
1         Mazda RX4 Wag    3.90  2.875  17.02
2            Datsun 710    3.85  2.320  18.61
3        Hornet 4 Drive    3.08  3.215  19.44
4     Hornet Sportabout    3.15  3.440  17.02
5               Valiant    2.76  3.460  20.22
6            Duster 360    3.21  3.570  15.84
7             Merc 240D    3.69  3.190  20.00
8              Merc 230    3.92  3.150  22.90
9              Merc 280    3.92  3.440  18.30
10            Merc 280C    3.92  3.440  18.90
11           Merc 450SE    3.07  4.070  17.40
12           Merc 450SL    3.07  3.730  17.60
13          Merc 450SLC    3.07  3.780  18.00
14   Cadillac Fleetwood    2.93  5.250  17.98
15  Lincoln Continental    3.00  5.424  17.82
16    Chrysler Imperial    3.23  5.345  17.42
17             Fiat 128    4.08  2.200  19.47
18          Honda Civic    4.93  1.615  18.52
19       Toyota Corolla    4.22  1.835  19.90
20        Toyota Corona    3.70  2.465  20.01
21     Dodge Challenger    2.76  3.520  16.87
22          AMC Javelin    3.15  3.435  17.30
23           Camaro Z28    3.73  3.840  15.41
24     Pontiac Firebird    3.08  3.845  17.05
25            Fiat X1-9    4.08  1.935  18.90
26        Porsche 914-2    4.43  2.140  16.70
27         Lotus Europa    3.77  1.513  16.90
28       Ford Pantera L    4.22  3.170  14.50
29         Ferrari Dino    3.62  2.770  15.50
30        Maserati Bora    3.54  3.570  14.60
31           Volvo 142E    4.11  2.780  18.60

In [27]:
df.sample() #selects random row from the data set

     Unnamed: 0  Points  Score  Weigh
13  Merc 450SLC    3.07   3.78   18.0

In [28]:
df.sample(10)

           Unnamed: 0  Points  Score  Weigh
30      Maserati Bora    3.54  3.570  14.60
20      Toyota Corona    3.70  2.465  20.01
10          Merc 280C    3.92  3.440  18.90
16  Chrysler Imperial    3.23  5.345  17.42
26      Porsche 914-2    4.43  2.140  16.70
25          Fiat X1-9    4.08  1.935  18.90
19     Toyota Corolla    4.22  1.835  19.90
18        Honda Civic    4.93  1.615  18.52
3      Hornet 4 Drive    3.08  3.215  19.44
31         Volvo 142E    4.11  2.780  18.60

In [30]:
df.head(10).mean() #chain method

  df.head(10).mean() #chain method

Points     3.538
Score      3.128
Weigh     18.581
dtype: float64

In [34]:
df.Points #displays a column in series

0     3.90
1     3.90
2     3.85
3     3.08
4     3.15
5     2.76
6     3.21
7     3.69
8     3.92
9     3.92
10    3.92
11    3.07
12    3.07
13    3.07
14    2.93
15    3.00
16    3.23
17    4.08
18    4.93
19    4.22
20    3.70
21    2.76
22    3.15
23    3.73
24    3.08
25    4.08
26    4.43
27    3.77
28    4.22
29    3.62
30    3.54
31    4.11
Name: Points, dtype: float64

In [36]:
df[["Points"]] #displays a column in dataframe

    Points
0     3.90
1     3.90
2     3.85
3     3.08
4     3.15
5     2.76
6     3.21
7     3.69
8     3.92
9     3.92
10    3.92
11    3.07
12    3.07
13    3.07
14    2.93
15    3.00
16    3.23
17    4.08
18    4.93
19    4.22
20    3.70
21    2.76
22    3.15
23    3.73
24    3.08
25    4.08
26    4.43
27    3.77
28    4.22
29    3.62
30    3.54
31    4.11

In [38]:
df.groupby("Weigh") #groups the data on bases of diff criteria

In [45]:
df[df["Points"]>4]  #displays values greater than specified number   FILTERS

        Unnamed: 0  Points  Score  Weigh
17        Fiat 128    4.08  2.200  19.47
18     Honda Civic    4.93  1.615  18.52
19  Toyota Corolla    4.22  1.835  19.90
25       Fiat X1-9    4.08  1.935  18.90
26   Porsche 914-2    4.43  2.140  16.70
28  Ford Pantera L    4.22  3.170  14.50
31      Volvo 142E    4.11  2.780  18.60

In [46]:
df.iloc[0] # first row    DATA SLICING

Unnamed: 0    Mazda RX4
Points              3.9
Score              2.62
Weigh             16.46
Name: 0, dtype: object

In [48]:
df.iloc[:,2]

0     2.620
1     2.875
2     2.320
3     3.215
4     3.440
5     3.460
6     3.570
7     3.190
8     3.150
9     3.440
10    3.440
11    4.070
12    3.730
13    3.780
14    5.250
15    5.424
16    5.345
17    2.200
18    1.615
19    1.835
20    2.465
21    3.520
22    3.435
23    3.840
24    3.845
25    1.935
26    2.140
27    1.513
28    3.170
29    2.770
30    3.570
31    2.780
Name: Score, dtype: float64

In [49]:
df.iloc[2,:]

Unnamed: 0    Datsun 710
Points              3.85
Score               2.32
Weigh              18.61
Name: 2, dtype: object

In [50]:
df.iloc[1,3]

17.02

In [55]:
df.iloc[1,0:4]

Unnamed: 0    Mazda RX4 Wag
Points                  3.9
Score                 2.875
Weigh                 17.02
Name: 1, dtype: object

In [57]:
df.iloc[0:11,:]

           Unnamed: 0  Points  Score  Weigh
0           Mazda RX4    3.90  2.620  16.46
1       Mazda RX4 Wag    3.90  2.875  17.02
2          Datsun 710    3.85  2.320  18.61
3      Hornet 4 Drive    3.08  3.215  19.44
4   Hornet Sportabout    3.15  3.440  17.02
5             Valiant    2.76  3.460  20.22
6          Duster 360    3.21  3.570  15.84
7           Merc 240D    3.69  3.190  20.00
8            Merc 230    3.92  3.150  22.90
9            Merc 280    3.92  3.440  18.30
10          Merc 280C    3.92  3.440  18.90

In [62]:
df.iloc[[0,4]]

          Unnamed: 0  Points  Score  Weigh
0          Mazda RX4    3.90   2.62  16.46
4  Hornet Sportabout    3.15   3.44  17.02